In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [160]:
data_holder = {}
min_year = 2002
max_year = 2020

for year in range(min_year, max_year+1):
    data_holder['data_'+str(year)] = pd.read_csv(f'weather_of_{year}.csv')

len(data_holder)

19

In [153]:
data_2002 = Data(2002)
data_2002.dataframe.head()

,ID,LOCATION,OCT,NOV,DEC,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,WY Total,Pct Avg to Date
0,4BK,BROOKINGS,6.43,14.53,17.32,17.32,9.10,6.05,6.62,3.65,3.68,0.02,0.03,1.45,86.20,117.0
1,ASHO3,ASHLAND,0.38,3.50,3.41,1.32,1.29,1.29,2.92,1.88,0.08,0.28,0.00,0.20,16.55,84.0
2,CVJO3,CAVE JUNCTION,2.46,13.60,14.81,9.76,6.46,4.63,1.94,0.89,0.00,0.00,0.00,0.33,54.88,88.0
3,GOLO3,GOLD BEACH,4.63,11.72,16.59,14.58,8.89,6.62,4.73,1.50,2.09,0.02,0.00,0.62,71.99,91.0
4,GPSO3,GRANTS PASS KAJO,0.39,6.37,6.94,4.31,2.89,1.36,0.87,0.62,0.02,0.00,0.00,0.05,23.82,77.0

In [10]:
data_2002.head()

,ID,LOCATION,OCT,NOV,DEC,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,WY Total,Pct Avg to Date
0,4BK,BROOKINGS,6.43,14.53,17.32,17.32,9.10,6.05,6.62,3.65,3.68,0.02,0.03,1.45,86.20,117.0
1,ASHO3,ASHLAND,0.38,3.50,3.41,1.32,1.29,1.29,2.92,1.88,0.08,0.28,0.00,0.20,16.55,84.0
2,CVJO3,CAVE JUNCTION,2.46,13.60,14.81,9.76,6.46,4.63,1.94,0.89,0.00,0.00,0.00,0.33,54.88,88.0
3,GOLO3,GOLD BEACH,4.63,11.72,16.59,14.58,8.89,6.62,4.73,1.50,2.09,0.02,0.00,0.62,71.99,91.0
4,GPSO3,GRANTS PASS KAJO,0.39,6.37,6.94,4.31,2.89,1.36,0.87,0.62,0.02,0.00,0.00,0.05,23.82,77.0

In [146]:
data_2002.isna().any(axis=1).sum()

18

Tried to fill NA values which are in 'Pct Avg to Date', but I could not figure out how to calculate for this column and it turns out that there are only few rows that are missing this column so I decided to drop these rows that consist NA values in 'Pct Avg to Date' column

In [148]:
data_2002.dropna()

,ID,LOCATION,OCT,NOV,DEC,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,WY Total,Pct Avg to Date
0,4BK,BROOKINGS,6.43,14.53,17.32,17.32,9.10,6.05,6.62,3.65,3.68,0.02,0.03,1.45,86.20,117.0
1,ASHO3,ASHLAND,0.38,3.50,3.41,1.32,1.29,1.29,2.92,1.88,0.08,0.28,0.00,0.20,16.55,84.0
2,CVJO3,CAVE JUNCTION,2.46,13.60,14.81,9.76,6.46,4.63,1.94,0.89,0.00,0.00,0.00,0.33,54.88,88.0
3,GOLO3,GOLD BEACH,4.63,11.72,16.59,14.58,8.89,6.62,4.73,1.50,2.09,0.02,0.00,0.62,71.99,91.0
4,GPSO3,GRANTS PASS KAJO,0.39,6.37,6.94,4.31,2.89,1.36,0.87,0.62,0.02,0.00,0.00,0.05,23.82,77.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
319,LENN2,GREAT BASIN N P,0.97,1.44,0.98,0.75,0.30,0.99,1.42,0.53,1.48,1.28,0.33,1.09,11.56,85.0
320,MNTN2,MONTELLO,0.03,1.22,0.40,0.85,0.00,0.43,1.44,0.75,0.31,0.67,0.00,1.51,7.61,90.0
321,CDEU1,CEDAR CITY 5E,0.30,1.00,1.05,0.32,0.25,0.94,0.24,0.02,0.00,0.39,0.18,1.46,6.15,41.0
322,EMRU1,ENTERPRISE,0.47,1.34,0.65,0.03,0.03,0.10,0.38,0.00,0.00,0.13,0.00,1.81,4.94,33.0
323,MLFU1,MILFORD,0.25,0.93,1.07,0.18,0.15,1.20,0.83,0.02,0.02,1.06,0.35,1.40,7.46,73.0